test/integration/data.pyvmomi.clone/request-68.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <CloneVM_Task xmlns="urn:vim25">
      <_this type="VirtualMachine">vm-64</_this>
      <folder type="Folder">group-v61</folder>
      <name>testvm_ansible_1</name>
      <spec>
        <location>
          <datastore type="Datastore">datastore-29</datastore>
          <pool type="ResourcePool">resgroup-39</pool>
          <host type="HostSystem">host-28</host>
        </location>
        <template>false</template>
        <powerOn>false</powerOn>
      </spec>
    </CloneVM_Task>
  </soapenv:Body>
</soapenv:Envelope>
